{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/AzureActivity",
  "name": "AzureActivity",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "id": "AzureActivity",
      "title": "Azure Activity",
      "publisher": "Microsoft",
      "descriptionMarkdown": "Azure Activity Log is a subscription log that provides insight into subscription-level events that occur in Azure, including events from Azure Resource Manager operational data, service health events, write operations taken on the resources in your subscription, and the status of activities performed in Azure. For more information, see the [Microsoft Sentinel documentation ](https://go.microsoft.com/fwlink/p/?linkid=2219695&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "AzureActivity",
          "baseQuery": "AzureActivity"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "IsConnectedQuery",
          "value": [
            "AzureActivity\n            | summarize LastLogReceived = max(TimeGenerated)\n            | project IsConnected = LastLogReceived > ago(7d)"
          ]
        }
      ],
      "dataTypes": [
        {
          "name": "AzureActivity",
          "lastDataReceivedQuery": "AzureActivity\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ]
    }
  }
}
