{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/ThreatIntelligence",
  "name": "ThreatIntelligence",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "id": "ThreatIntelligence",
      "title": "Threat Intelligence Platforms",
      "publisher": "Microsoft",
      "descriptionMarkdown": "Microsoft Sentinel integrates with Microsoft Graph Security API data sources to enable monitoring, alerting, and hunting using your threat intelligence. Use this connector to send threat indicators to Microsoft Sentinel from your Threat Intelligence Platform (TIP), such as Threat Connect, Palo Alto Networks MindMeld, MISP, or other integrated applications. Threat indicators can include IP addresses, domains, URLs, and file hashes. For more information, see the [Microsoft Sentinel documentation >](https://go.microsoft.com/fwlink/p/?linkid=2223729&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "ThreatIntelligenceIndicator",
          "baseQuery": "ThreatIntelligenceIndicator | where SourceSystem == \"SecurityGraph\""
        }
      ],
      "connectivityCriterias": [
        {
          "type": "SentinelKinds",
          "value": [
            "ThreatIntelligence"
          ]
        }
      ],
      "dataTypes": [
        {
          "name": "ThreatIntelligenceIndicator",
          "lastDataReceivedQuery": "ThreatIntelligenceIndicator | where SourceSystem == \"SecurityGraph\"\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ]
    }
  }
}
