{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/SecurityEvents",
  "name": "SecurityEvents",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "title": "Security Events via Legacy Agent",
      "publisher": "Microsoft",
      "descriptionMarkdown": "You can stream all security events from the Windows machines connected to your Microsoft Sentinel workspace using the Windows agent. This connection enables you to view dashboards, create custom alerts, and improve investigation. This gives you more insight into your organization’s network and improves your security operation capabilities. For more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2220093&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "SecurityEvents",
          "baseQuery": "SecurityEvent"
        }
      ],
      "dataTypes": [
        {
          "name": "SecurityEvents",
          "lastDataReceivedQuery": "SecurityEvent\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "SecurityEvents",
          "value": null
        }
      ],
      "id": "SecurityEvents"
    }
  }
}
