{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/OfficeATP",
  "name": "OfficeATP",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "title": "Microsoft Defender for Office 365 (Preview)",
      "publisher": "Microsoft",
      "descriptionMarkdown": "Microsoft Defender for Office 365 safeguards your organization against malicious threats posed by email messages, links (URLs) and collaboration tools. By ingesting Microsoft Defender for Office 365 alerts into Microsoft Sentinel, you can incorporate information about email- and URL-based threats into your broader risk analysis and build response scenarios accordingly.\n \nThe following types of alerts will be imported:\n\n-   A potentially malicious URL click was detected \n-   Email messages containing malware removed after delivery\n-   Email messages containing phish URLs removed after delivery\n-   Email reported by user as malware or phish \n-   Suspicious email sending patterns detected \n-   User restricted from sending email \n\nThese alerts can be seen by Office customers in the ** Office Security and Compliance Center**.\n\nFor more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2219942&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "SecurityAlert (Office 365 Advanced Threat Protection)",
          "baseQuery": "SecurityAlert\n| where ProviderName == \"OATP\""
        }
      ],
      "dataTypes": [
        {
          "name": "SecurityAlert(OATP)",
          "lastDataReceivedQuery": "SecurityAlert\n| where ProviderName == \"OATP\"\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "SentinelKinds",
          "value": [
            "OfficeATP"
          ]
        }
      ],
      "id": "OfficeATP"
    }
  }
}
