{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/MicrosoftDefenderAdvancedThreatProtection",
  "name": "MicrosoftDefenderAdvancedThreatProtection",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "title": "Microsoft Defender for Endpoint",
      "publisher": "Microsoft",
      "descriptionMarkdown": "Microsoft Defender for Endpoint is a security platform designed to prevent, detect, investigate, and respond to advanced threats. The platform creates alerts when suspicious security events are seen in an organization. Fetch alerts generated in Microsoft Defender for Endpoint to Microsoft Sentinel so that you can effectively analyze security events. You can create rules, build dashboards and author playbooks for immediate response. For more information, see the [Microsoft Sentinel documentation >](https://go.microsoft.com/fwlink/p/?linkid=2220128&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "SecurityAlert (MDATP)",
          "baseQuery": "SecurityAlert | where ProviderName == \"MDATP\""
        }
      ],
      "dataTypes": [
        {
          "name": "SecurityAlert (MDATP)",
          "lastDataReceivedQuery": "SecurityAlert | where ProviderName == \"MDATP\"\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "SentinelKinds",
          "value": [
            "MicrosoftDefenderAdvancedThreatProtection"
          ]
        }
      ],
      "id": "MicrosoftDefenderAdvancedThreatProtection"
    }
  }
}
