{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/WindowsForwardedEvents",
  "name": "WindowsForwardedEvents",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "title": "Windows Forwarded Events",
      "publisher": "Microsoft",
      "descriptionMarkdown": "You can stream all Windows Event Forwarding (WEF) logs from the Windows Servers connected to your Microsoft Sentinel workspace using Azure Monitor Agent (AMA).\n\tThis connection enables you to view dashboards, create custom alerts, and improve investigation.\n\tThis gives you more insight into your organization’s network and improves your security operation capabilities. For more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2219963&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "WindowsEvents",
          "baseQuery": "WindowsEvent"
        }
      ],
      "dataTypes": [
        {
          "name": "WindowsEvents",
          "lastDataReceivedQuery": "WindowsEvent\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "WindowsForwardedEvents",
          "value": null
        }
      ],
      "id": "WindowsForwardedEvents"
    }
  }
}
