{
  "id": "/subscriptions/d7425a42-e8c6-4a20-8d02-c2d534dc8a85/resourceGroups/rg-buisecops-cybermxdr-westeu/providers/Microsoft.OperationalInsights/workspaces/log-buisecops-cybermxdr-westeu/providers/Microsoft.SecurityInsights/dataConnectors/OfficeIRM",
  "name": "OfficeIRM",
  "type": "Microsoft.SecurityInsights/dataConnectors",
  "kind": "StaticUI",
  "properties": {
    "connectorUiConfig": {
      "title": "Microsoft 365 Insider Risk Management",
      "publisher": "Microsoft",
      "descriptionMarkdown": "Microsoft 365 Insider Risk Management is a compliance solution in Microsoft 365 that helps minimize internal risks by enabling you to detect, investigate, and act on malicious and inadvertent activities in your organization. Risk analysts in your organization can quickly take appropriate actions to make sure users are compliant with your organization's compliance standards.\n\nInsider risk policies allow you to:\n\n-   define the types of risks you want to identify and detect in your organization.\n-   decide on what actions to take in response, including escalating cases to Microsoft Advanced eDiscovery if needed.\n\nThis solution produces alerts that can be seen by Office customers in the Insider Risk Management solution in Microsoft 365 Compliance Center.\n[Learn More](https://aka.ms/OfficeIRMConnector) about Insider Risk Management.\n\nThese alerts can be imported into Microsoft Sentinel with this connector, allowing you to see, investigate, and respond to them in a broader organizational threat context. For more information, see the [Microsoft Sentinel documentation](https://go.microsoft.com/fwlink/p/?linkid=2223721&wt.mc_id=sentinel_dataconnectordocs_content_cnl_csasci).",
      "graphQueries": [
        {
          "metricName": "Total data received",
          "legend": "SecurityAlert (Microsoft 365 Insider Risk Management)",
          "baseQuery": "SecurityAlert\n    | where ProductName == \"Microsoft 365 Insider Risk Management\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false"
        }
      ],
      "dataTypes": [
        {
          "name": "SecurityAlert (OfficeIRM)",
          "lastDataReceivedQuery": "SecurityAlert\n    | where ProductName == \"Microsoft 365 Insider Risk Management\"\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false\n        | extend alertWasCustomized = bag_has_key(todynamic(ExtendedProperties), \"OriginalProductName\")\n        | where alertWasCustomized == false\n            | summarize Time = max(TimeGenerated)\n            | where isnotempty(Time)"
        }
      ],
      "connectivityCriterias": [
        {
          "type": "SentinelKinds",
          "value": [
            "OfficeIRM"
          ]
        }
      ],
      "id": "OfficeIRM"
    }
  }
}
